In [1]:
import pandas as pd
ship = pd.read_csv('http://bit.ly/kaggletrain')

In [2]:
ship.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
ship.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [4]:
#Data filtering ==,!=, >= , <= ,>,<
#Categorical data encoding

#Count all the instance where condition satisfied
(ship['Survived'] == 1).sum()

342

In [5]:
#Filter all the instance where condition satisfied
survived = ship[ship['Survived'] == 1]

In [6]:
n_survived = ship[ship['Survived'] != 1]

In [7]:
n_survived

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
ship['Survived'].unique()

array([0, 1], dtype=int64)

In [9]:
#unique() - return the unique categorical value in a data series
ship['Pclass'].unique()

array([3, 1, 2], dtype=int64)

In [10]:
ship[ship['Pclass'] == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [11]:
#Filter all the paseengers from class 1 who couldn't survived
ship[(ship['Pclass'] == 3) & (ship['Survived'] == 0)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
12,13,0,3,"Saundercock, Mr. William Henry",male,20.0,0,0,A/5. 2151,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [12]:
ship[(ship['Pclass'] == 2) | (ship['Pclass'] == 1)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [13]:
#or operation between 2 and 3
ship[ship['Pclass'].isin([2,3])]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [14]:
name = 'Braund, Mr. Owen Harris'
print(name.split(','))
print(name.split(',')[0])
print(name.split(',')[1])
print(name.split(',')[-1])

['Braund', ' Mr. Owen Harris']
Braund
 Mr. Owen Harris
 Mr. Owen Harris

In [15]:
k = [3,5,6,7,8,9]
k[-2]

8

In [20]:
querry = input(['Enter your name and Age using comma'])
if(int((querry.split(',')[-1])) > 18):
  print(querry.split(',')[0],'You can vote')
else:
  print(querry.split(',')[0],'You can not vote')

['Enter your name and Age using comma']Prashant,20
Prashant You can vote

In [21]:
ship['Name'].str.split(',')[10][0]

'Sandstrom'

In [22]:
#Seperate surname from the names
surname=[]
for i in range(len(ship)):
  surname.append(ship['Name'].str.split(',')[i][0])

In [23]:
ship.insert(4,'Surname',surname)

In [24]:
ship.head(5)

,PassengerId,Survived,Pclass,Name,Surname,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",Braund,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",Heikkinen,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle,female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",Allen,male,35.0,0,0,373450,8.0500,NaN,S

In [25]:
ship['Sex'].unique()

array(['male', 'female'], dtype=object)

In [26]:
#map() - used to map a categorical string value into categorical numerical value
s_map = ship['Sex'].map({'male':0 , 'female':1})

In [27]:
ship.insert(6,'mapped_gender',s_map)

In [28]:
ship.head(5)

,PassengerId,Survived,Pclass,Name,Surname,Sex,mapped_gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",Braund,male,0,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,female,1,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",Heikkinen,female,1,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle,female,1,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",Allen,male,0,35.0,0,0,373450,8.0500,NaN,S

In [29]:
(ship['Age'] == ship['Age'].min()).sum()

1

In [30]:
#idxmin() - returns the location of minimum value
ship.loc[ship['Age'].idxmin()]['Name']

'Thomas, Master. Assad Alexander'

In [31]:
(ship['Age'] == ship['Age'].max()).sum()

1

In [32]:
#idxmax() - returns the location of maximum value
ship.loc[ship['Age'].idxmax()]['Name']

'Barkworth, Mr. Algernon Henry Wilson'

In [33]:
ship[ship['Age'] == ship['Age'].max()]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

In [34]:
ship[ship['Pclass'] == 1]['Fare'].mean()

84.1546875

In [35]:
ship[ship['Pclass'] == 2]['Fare'].mean()

20.662183152173913

In [36]:
ship[ship['Pclass'] == 3]['Fare'].mean()

13.675550101832993

In [37]:
#isnull() - will return true in case of null values
ship.isnull().sum()

PassengerId        0
Survived           0
Pclass             0
Name               0
Surname            0
Sex                0
mapped_gender      0
Age              177
SibSp              0
Parch              0
Ticket             0
Fare               0
Cabin            687
Embarked           2
dtype: int64

In [38]:
ship[ship['Sex'] == 'male']['Age'].mean()

30.72664459161148

In [39]:
round(ship[ship['Sex'] == 'male']['Age'].mean(),2)

30.73

In [42]:
m = ship[ship['Sex'] == 'male']
m['Age'] = m['Age'].fillna(round(ship[ship['Sex'] == 'male']['Age'].mean(),2))

<ipython-input-42-403dcd22eab1>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  m['Age'] = m['Age'].fillna(round(ship[ship['Sex'] == 'male']['Age'].mean(),2))

In [43]:
m

,PassengerId,Survived,Pclass,Name,Surname,Sex,mapped_gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",Braund,male,0,22.00,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",Allen,male,0,35.00,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",Moran,male,0,30.73,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",McCarthy,male,0,54.00,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",Palsson,male,0,2.00,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,884,0,2,"Banfield, Mr. Frederick James",Banfield,male,0,28.00,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",Sutehall,male,0,25.00,0,0,SOTON/OQ 392076,7.0500,NaN,S
886,887,0,2,"Montvila, Rev. Juozas",Montvila,male,0,27.00,0,0,211536,13.0000,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",Behr,male,0,26.00,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",Dooley,male,0,32.00,0,0,370376,7.7500,NaN,Q

In [44]:
round(ship[ship['Sex'] == 'female']['Age'].mean(),2)

27.92

In [45]:
f = ship[ship['Sex'] == 'female']
f['Age'] = f['Age'].fillna(round(ship[ship['Sex'] == 'female']['Age'].mean(),2))

<ipython-input-45-7de74e1786f5>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  f['Age'] = f['Age'].fillna(round(ship[ship['Sex'] == 'female']['Age'].mean(),2))

In [46]:
f

,PassengerId,Survived,Pclass,Name,Surname,Sex,mapped_gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",Cumings,female,1,38.00,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",Heikkinen,female,1,26.00,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",Futrelle,female,1,35.00,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",Johnson,female,1,27.00,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",Nasser,female,1,14.00,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",Shelley,female,1,25.00,0,1,230433,26.0000,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",Dahlberg,female,1,22.00,0,0,7552,10.5167,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",Rice,female,1,39.00,0,5,382652,29.1250,NaN,Q
887,888,1,1,"Graham, Miss. Margaret Edith",Graham,female,1,19.00,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",Johnston,female,1,27.92,1,2,W./C. 6607,23.4500,NaN,S

In [47]:
ship = m.append(f)

In [48]:
ship.isnull().sum()

PassengerId        0
Survived           0
Pclass             0
Name               0
Surname            0
Sex                0
mapped_gender      0
Age                0
SibSp              0
Parch              0
Ticket             0
Fare               0
Cabin            687
Embarked           2
dtype: int64

In [49]:
ship['Age'].mode()

0    30.73
dtype: float64

In [50]:
ship['Age'] = ship['Age'].fillna(29.70)

In [51]:
ship.shape

(891, 14)

In [52]:
ship = ship.drop('Cabin',axis=1)

In [53]:
ship['Embarked'].unique()

array(['S', 'Q', 'C', nan], dtype=object)

In [54]:
K = pd.DataFrame({'a':[1,2,3] , 'b':[3,5,6]})
L = pd.DataFrame({'x':[6,7,8] , 'y':[4,6,7]})

In [55]:
K

   a  b
0  1  3
1  2  5
2  3  6

In [56]:
L

   x  y
0  6  4
1  7  6
2  8  7

In [57]:
K.append(L).reset_index().drop('index',axis=1)

     a    b    x    y
0  1.0  3.0  NaN  NaN
1  2.0  5.0  NaN  NaN
2  3.0  6.0  NaN  NaN
3  NaN  NaN  6.0  4.0
4  NaN  NaN  7.0  6.0
5  NaN  NaN  8.0  7.0

In [58]:
K.append(L)

     a    b    x    y
0  1.0  3.0  NaN  NaN
1  2.0  5.0  NaN  NaN
2  3.0  6.0  NaN  NaN
0  NaN  NaN  6.0  4.0
1  NaN  NaN  7.0  6.0
2  NaN  NaN  8.0  7.0

In [62]:
ship.Cabin.value_counts()

AttributeError: 'DataFrame' object has no attribute 'Cabin'

In [63]:
ship = ship.drop('Cabin',axis=1)

KeyError: "['Cabin'] not found in axis"

In [64]:
ship.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Surname          0
Sex              0
mapped_gender    0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [65]:
#isnull()
#fillna()
#dropna()
print(ship.shape)
ship = ship.dropna(axis=0)
print(ship.shape)

(891, 13)
(889, 13)

In [66]:
print(ship.shape)
b = ship.dropna(axis=1)
print(b.shape)

(889, 13)
(889, 13)

In [67]:
ship['Embarked']

0      S
4      S
5      Q
6      S
7      S
      ..
880    S
882    S
885    Q
887    S
888    S
Name: Embarked, Length: 889, dtype: object

In [68]:
#get_dummies - to generate dummy value for categorical values
ship = pd.get_dummies(ship,columns=['Sex','Embarked'],drop_first=True)

In [69]:
ship.head(5)

,PassengerId,Survived,Pclass,Name,Surname,mapped_gender,Age,SibSp,Parch,Ticket,Fare,Sex_male,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",Braund,0,22.00,1,0,A/5 21171,7.2500,1,0,1
4,5,0,3,"Allen, Mr. William Henry",Allen,0,35.00,0,0,373450,8.0500,1,0,1
5,6,0,3,"Moran, Mr. James",Moran,0,30.73,0,0,330877,8.4583,1,1,0
6,7,0,1,"McCarthy, Mr. Timothy J",McCarthy,0,54.00,0,0,17463,51.8625,1,0,1
7,8,0,3,"Palsson, Master. Gosta Leonard",Palsson,0,2.00,3,1,349909,21.0750,1,0,1

In [70]:
ship.dtypes

PassengerId        int64
Survived           int64
Pclass             int64
Name              object
Surname           object
mapped_gender      int64
Age              float64
SibSp              int64
Parch              int64
Ticket            object
Fare             float64
Sex_male           uint8
Embarked_Q         uint8
Embarked_S         uint8
dtype: object

1. Total no. of matches
2. Season with maximum no. of matches
3. Team who won maximum matches
4. Team won by maximum runs
5. Team won by maximum wickets
6. %ge of winner if they won toss as well
6. %ge of winner if they did batting first

In [73]:
ipl = pd.read_csv('./ipl_matches - ipl_matches.csv')
ipl.head(5)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,2017-04-06,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,2017-04-07,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,2017,Indore,2017-04-08,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
4,5,2017,Bangalore,2017-04-08,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN

In [74]:
#Total Matches
print(len(ipl))

756

In [75]:
#To calculate repetations - value_counts()
#season with maximum no. of matches
ipl['season'].value_counts().idxmax()

2013

In [84]:
#4. team won by maximum runs
ipl.loc[ipl['win_by_runs'].idxmax()]['winner']

'Mumbai Indians'

In [88]:
ipl['win_by_runs'].idxmax()

43

In [91]:
ipl['winner'][43]

'Mumbai Indians'

In [92]:
# 5. winner by maximum wickets
ipl.loc[ipl['win_by_wickets'].idxmax()]['winner']

'Kolkata Knight Riders'

In [78]:
ipl[ipl['win_by_wickets'] == ipl['win_by_wickets'].max()]['winner']

2            Kolkata Knight Riders
34                 Kings XI Punjab
71                 Deccan Chargers
119               Delhi Daredevils
183    Royal Challengers Bangalore
298               Rajasthan Royals
376                 Mumbai Indians
390            Chennai Super Kings
542    Royal Challengers Bangalore
590            Sunrisers Hyderabad
683    Royal Challengers Bangalore
Name: winner, dtype: object

In [79]:
# 6. % of winner who winn the toss
(ipl['winner'] == ipl['toss_winner']).sum()/len(ipl)

0.5198412698412699

In [93]:
ipl['result'].value_counts()

normal       743
tie            9
no result      4
Name: result, dtype: int64

In [101]:
# 3. Team who won maximum matches
ipl['winner'].value_counts()

Mumbai Indians                 109
Chennai Super Kings            100
Kolkata Knight Riders           92
Royal Challengers Bangalore     84
Kings XI Punjab                 82
Rajasthan Royals                75
Delhi Daredevils                67
Sunrisers Hyderabad             58
Deccan Chargers                 29
Gujarat Lions                   13
Pune Warriors                   12
Rising Pune Supergiant          10
Delhi Capitals                  10
Kochi Tuskers Kerala             6
Rising Pune Supergiants          5
Name: winner, dtype: int64

In [107]:
# 7. % of winner if they choose batting first
ipl['winner'] == ipl(ipl.toss_decision =='bat')

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [112]:

ipl.winner == ipl.toss_winner.astype(int) & ipl.toss_decision==bat

ValueError: invalid literal for int() with base 10: 'Royal Challengers Bangalore'

In [109]:
ipl.head(1)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,2017-04-05,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN

1. Movies with ratings more then 8.5 and from genre Comedy,Crime or Action and duration more then 160
2. Extract all the movies of actor 'Tim Robbins'
3. Highly rated movie of each genre

In [94]:
imdb = pd.read_csv('http://bit.ly/imdbratings')

In [95]:
imdb.head(5)

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."

In [113]:
imdb.actors_list

0      [u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt...
1        [u'Marlon Brando', u'Al Pacino', u'James Caan']
2      [u'Al Pacino', u'Robert De Niro', u'Robert Duv...
3      [u'Christian Bale', u'Heath Ledger', u'Aaron E...
4      [u'John Travolta', u'Uma Thurman', u'Samuel L....
                             ...
974    [u'Dustin Hoffman', u'Jessica Lange', u'Teri G...
975    [u'Michael J. Fox', u'Christopher Lloyd', u'Ma...
976    [u'Russell Crowe', u'Paul Bettany', u'Billy Bo...
977    [u'JoBeth Williams', u"Heather O'Rourke", u'Cr...
978    [u'Charlie Sheen', u'Michael Douglas', u'Tamar...
Name: actors_list, Length: 979, dtype: object

In [116]:
imdb.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [117]:
imdb.shape

(979, 6)

In [118]:
imdb2 = imdb.copy()

In [129]:
content_rating_array = imdb.content_rating.unique()
len(content_rating_array)

13

In [132]:
for i in content_rating_array:
    imdb.content_rating_array

dtype('O')